## Task - 1 Create a pandas dataframe (DataFrame name as 'df') (10 observation and 5 features)

In [1]:
import pandas as pd

In [2]:
marks = {'Name':['Prateek','Prachi','Nipul','Sanit','Rhea','Rohan','Sarthak','Krish','Rishika','Vani'],'Roll No':[21,23,25,29,35,13,14,45,36,10],'Maths':[100,95,82,91,68,75,91,49,68,90],'Science':[97,58,63,72,88,94,96,71,58,60],'English':[85,82,71,65,73,75,71,77,65,50]}

In [3]:
marks

{'Name': ['Prateek',
  'Prachi',
  'Nipul',
  'Sanit',
  'Rhea',
  'Rohan',
  'Sarthak',
  'Krish',
  'Rishika',
  'Vani'],
 'Roll No': [21, 23, 25, 29, 35, 13, 14, 45, 36, 10],
 'Maths': [100, 95, 82, 91, 68, 75, 91, 49, 68, 90],
 'Science': [97, 58, 63, 72, 88, 94, 96, 71, 58, 60],
 'English': [85, 82, 71, 65, 73, 75, 71, 77, 65, 50]}

In [4]:
df = pd.DataFrame(marks)
df

      Name  Roll No  Maths  Science  English
0  Prateek       21    100       97       85
1   Prachi       23     95       58       82
2    Nipul       25     82       63       71
3    Sanit       29     91       72       65
4     Rhea       35     68       88       73
5    Rohan       13     75       94       75
6  Sarthak       14     91       96       71
7    Krish       45     49       71       77
8  Rishika       36     68       58       65
9     Vani       10     90       60       50

## Task- 2 Check the info of 'df'

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     10 non-null     object
 1   Roll No  10 non-null     int64
 2   Maths    10 non-null     int64
 3   Science  10 non-null     int64
 4   English  10 non-null     int64
dtypes: int64(4), object(1)
memory usage: 528.0+ bytes

## Task 3- Check the descriptive statistics of 'df'

In [7]:
df.describe()

         Roll No       Maths    Science    English
count  10.000000   10.000000  10.000000  10.000000
mean   25.100000   80.900000  75.700000  71.400000
std    11.288637   15.765292  16.404945   9.912954
min    10.000000   49.000000  58.000000  50.000000
25%    15.750000   69.750000  60.750000  66.500000
50%    24.000000   86.000000  71.500000  72.000000
75%    33.500000   91.000000  92.500000  76.500000
max    45.000000  100.000000  97.000000  85.000000

## Task 4- Check the 4th index observation with 'loc' slicing operator.

In [9]:
df.loc[4]

Name       Rhea
Roll No      35
Maths        68
Science      88
English      73
Name: 4, dtype: object

## Task 5 - Check the null values in your 'df'

In [10]:
df.isnull()

    Name  Roll No  Maths  Science  English
0  False    False  False    False    False
1  False    False  False    False    False
2  False    False  False    False    False
3  False    False  False    False    False
4  False    False  False    False    False
5  False    False  False    False    False
6  False    False  False    False    False
7  False    False  False    False    False
8  False    False  False    False    False
9  False    False  False    False    False

In [11]:
df.isnull().any()

Name       False
Roll No    False
Maths      False
Science    False
English    False
dtype: bool